cf_billing/Documents/энргУстановитьГруппуПотребителейАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргУстановитьГруппуПотребителейАбонента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргГруппыПотребителейАбонентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контроллер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьАдресОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьГруппаПотребителей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьМКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыБлагоустройстваТарифныеКатегории</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяКатегория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/энргУстановитьГруппуПотребителейАбонента/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
			
	//КомандаОтчет 									= КомандыОтчетов.Добавить();	
	//КомандаОтчет.Идентификатор 						= Метаданные.Отчеты.энргКарточкаАбонента.ПолноеИмя();
	//КомандаОтчет.Представление 						= НСтр("ru = 'Карточка абонента'");
	//КомандаОтчет.Порядок      						= 50;
	////КомандаОтчет.РежимИспользованияПараметра 		= РежимИспользованияПараметраКоманды.Одиночный;
	////КомандаОтчет.МестоРазмещенияКоманды 			= "ПодменюОтчетыСмТакже";
	//КомандаОтчет.ФункциональныеОпции 				= "";	
	//КомандаОтчет.Картинка 							= БиблиотекаКартинок.Рассчитать;
	//
	//КомандаОтчет 									= КомандыОтчетов.Добавить();	
	//КомандаОтчет.Идентификатор 						= Метаданные.Отчеты.энргПредполагаемыеНачисленияАбонента.ПолноеИмя();
	//КомандаОтчет.Представление 						= НСтр("ru = 'Предполагаемые начисления'");
	//КомандаОтчет.Порядок      						= 50;
	////КомандаОтчет.РежимИспользованияПараметра 		= РежимИспользованияПараметраКоманды.Одиночный;
	////КомандаОтчет.МестоРазмещенияКоманды 			= "ПодменюОтчетыСмТакже";
	//КомандаОтчет.ФункциональныеОпции 				= "";
	//КомандаОтчет.Картинка 							= БиблиотекаКартинок.ВидРасчета;
	
	энргВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);

КонецПроцедуры

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 ТаблицаЗначений
//
Функция ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт

	Возврат Документы.энргПерерасчет.ДобавитьКомандуСоздатьНаОснованииУстановитьГруппуПотребителейАбонента(КомандыСоздатьНаОсновании);

КонецФункции

#Область РеализацияИнтерфейса_РаботаСоСтабильнымиПериодыми

// Возвращает соответствие изменяемые параметры расчета.
// 
// Возвращаемое значение:
//   Соответствие.
//
Функция ИзменяемыеПараметрыРасчета() Экспорт 
	
	ИзменяемыеПараметрыРасчета 	= Новый Соответствие;                  	
	ИзменяемыеПараметры 		= Новый Массив;	
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи,Ресурсы","Услуга", "ТарифнаяГруппа"));	
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.ПустаяСсылка(), ИзменяемыеПараметры);
	Возврат ИзменяемыеПараметрыРасчета;
			
КонецФункции

// Получает данные для проведения по стабильным периодам.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ВыбираемыеТаблицы	-	Массив.
//
Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодам(Схема,ВыбираемыеТаблицы) Экспорт	
	ИмяТаблицы 											= "ДанныеДокументовУстановитьГруппуПотребителейАбонента";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстДляПроведенияПоСтабильнымПериодамУстановитьГруппуПотребителейАбонента());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса());				
	КонецЦикла;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл				
		Если НЕ врПакет.ТаблицаДляПомещения = ИмяТаблицы Тогда
			ПакетУничтожение 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
			ПакетУничтожение.ИмяТаблицы 				= врПакет.ТаблицаДляПомещения;
		КонецЕсли;				
	КонецЦикла;
				
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстДляПроведенияПоСтабильнымПериодамУстановитьГруппуПотребителейАбонента()
	Текст  	= 
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведения.Строение КАК Строение,
	|	ДокументыДляПроведения.Помещение КАК Помещение,
	|	ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	Шапка.Ссылка КАК ДокРегистратор,
	|	Шапка.Дата КАК ДатаРегистратора,
	|	табВидыБлагоустройстваТарифныеКатегории.Услуга КАК Услуга,
	|	табВидыБлагоустройстваТарифныеКатегории.ТарифнаяКатегория КАК ТарифнаяГруппа
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьГруппуПотребителейАбонента КАК Шапка
	|		ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка
	|			И ДокументыДляПроведения.КлючПомещения = Шапка.КлючПомещения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьГруппуПотребителейАбонента.ВидыБлагоустройстваТарифныеКатегории КАК табВидыБлагоустройстваТарифныеКатегории
	|		ПО (ДокументыДляПроведения.ДокРегистратор = табВидыБлагоустройстваТарифныеКатегории.Ссылка)";

	Возврат Текст;
КонецФункции

#КонецОбласти

#КонецЕсли
